{
  "word2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<START>": 2,
    "<END>": 3,
    "black": 4,
    "short": 5,
    "sleeved": 6,
    "t": 7,
    "shirt": 8,
    "paired": 9,
    "with": 10,
    "blue": 11,
    "jeans": 12,
    "and": 13,
    "white": 14,
    "sneakers": 15,
    "a": 16,
    "casual": 17,
    "indoor": 18,
    "setting": 19,
    "in": 20,
    "modern": 21,
    "cafe": 22,
    "glass": 23,
    "windows": 24,
    "wooden": 25,
    "benches": 26,
    "visible": 27,
    "the": 28,
    "background": 29,
    "two": 30,
    "wear": 31,
    "featuring": 32,
    "navy": 33,
    "long": 34,
    "sleeve": 35,
    "top": 36,
    "light": 37,
    "mini": 38,
    "skirt": 39,
    "scene": 40,
    "is": 41,
    "set": 42,
    "against": 43,
    "minimalist": 44,
    "backdrop": 45,
    "sleek": 46,
    "metal": 47,
    "wall": 48,
    "railing": 49,
    "add": 50,
    "to": 51,
    "urban": 52,
    "aesthetic": 53,
    "flowy": 54,
    "blouse": 55,
    "sleeves": 56,
    "subtle": 57,
    "floral": 58,
    "pattern": 59,
    "caf": 60,
    "design": 61,
    "features": 62,
    "coffee": 63,
    "shop": 64,
    "counter": 65,
    "warm": 66,
    "lighting": 67,
    "loose": 68,
    "fitting": 69,
    "cardigan": 70,
    "cozy": 71,
    "decor": 72,
    "large": 73,
    "furniture": 74,
    "enhance": 75,
    "ambiance": 76,
    "mint": 77,
    "green": 78,
    "distressed": 79,
    "textured": 80,
    "grid": 81,
    "like": 82,
    "fence": 83,
    "soft": 84,
    "natural": 85,
    "sleeveless": 86,
    "knee": 87,
    "length": 88,
    "dress": 89,
    "fitted": 90,
    "bodice": 91,
    "flared": 92,
    "on": 93,
    "dark": 94,
    "studio": 95,
    "plain": 96,
    "neutral": 97,
    "solid": 98,
    "gray": 99,
    "emphasizing": 100,
    "model": 101,
    "fabric": 102,
    "adorned": 103,
    "delicate": 104,
    "devoid": 105,
    "of": 106,
    "additional": 107,
    "elements": 108,
    "focusing": 109,
    "solely": 110,
    "plaid": 111,
    "relaxed": 112,
    "fit": 113,
    "texture": 114,
    "style": 115,
    "clean": 116,
    "uncluttered": 117,
    "garment": 118,
    "denim": 119,
    "shorts": 120,
    "rolled": 121,
    "cuffs": 122,
    "red": 123,
    "street": 124,
    "person": 125,
    "walking": 126,
    "paved": 127,
    "path": 128,
    "trees": 129,
    "building": 130,
    "patterned": 131,
    "jogger": 132,
    "pants": 133,
    "drawstring": 134,
    "waist": 135,
    "elastic": 136,
    "outdoor": 137,
    "rustic": 138,
    "door": 139,
    "concrete": 140,
    "stone": 141,
    "steps": 142,
    "base": 143,
    "material": 144,
    "appears": 145,
    "be": 146,
    "lightweight": 147,
    "indoors": 148,
    "likely": 149,
    "no": 150,
    "details": 151,
    "or": 152,
    "objects": 153,
    "made": 154,
    "smooth": 155,
    "flowing": 156,
    "unadorned": 157,
    "attention": 158,
    "outfit": 159,
    "colorful": 160,
    "graphic": 161,
    "print": 162,
    "comfortable": 163,
    "woman": 164,
    "posing": 165,
    "beige": 166,
    "couch": 167,
    "includes": 168,
    "potted": 169,
    "plant": 170,
    "window": 171,
    "blinds": 172,
    "bookshelf": 173,
    "maxi": 174,
    "sheen": 175,
    "high": 176,
    "vibrant": 177,
    "lush": 178,
    "greenery": 179,
    "flowers": 180,
    "foliage": 181,
    "creating": 182,
    "lounge": 183,
    "area": 184,
    "bench": 185,
    "striped": 186,
    "cushion": 187,
    "slim": 188,
    "weathered": 189,
    "grass": 190,
    "scattered": 191,
    "atmosphere": 192,
    "industrial": 193,
    "vibe": 194,
    "flooring": 195,
    "mix": 196,
    "an": 197,
    "blurred": 198,
    "clear": 199,
    "sky": 200,
    "checkered": 201,
    "piece": 202,
    "yet": 203,
    "stylish": 204,
    "look": 205,
    "panels": 206,
    "walls": 207,
    "create": 208,
    "contemporary": 209,
    "ensemble": 210,
    "shopping": 211,
    "mall": 212,
    "display": 213,
    "cases": 214,
    "floors": 215,
    "pink": 216,
    "waisted": 217,
    "streaming": 218,
    "through": 219,
    "sheer": 220,
    "curtains": 221,
    "armchair": 222,
    "floor": 223,
    "lamp": 224,
    "matching": 225,
    "both": 226,
    "possibly": 227,
    "park": 228,
    "tables": 229,
    "chairs": 230,
    "deck": 231,
    "suggesting": 232,
    "trousers": 233,
    "chair": 234,
    "table": 235,
    "elegant": 236,
    "off": 237,
    "shoulder": 238,
    "puffy": 239,
    "tones": 240,
    "intimate": 241,
    "oversized": 242,
    "stands": 243,
    "city": 244,
    "near": 245,
    "storefronts": 246,
    "are": 247,
    "silhouette": 248,
    "highlights": 249,
    "s": 250,
    "coat": 251,
    "wide": 252,
    "underneath": 253,
    "streetwear": 254,
    "yellow": 255,
    "distant": 256,
    "pedestrians": 257,
    "depth": 258,
    "lively": 259,
    "peach": 260,
    "colored": 261,
    "tiled": 262,
    "suggest": 263,
    "public": 264,
    "space": 265,
    "text": 266,
    "geometric": 267,
    "patterns": 268,
    "orange": 269,
    "hues": 270,
    "room": 271,
    "cotton": 272,
    "lights": 273,
    "buildings": 274,
    "indistinct": 275,
    "brown": 276,
    "boots": 277,
    "clothing": 278,
    "store": 279,
    "shelves": 280,
    "hanging": 281,
    "decorations": 282,
    "embroidery": 283,
    "tiles": 284,
    "road": 285,
    "tunic": 286,
    "three": 287,
    "quarter": 288,
    "front": 289,
    "pockets": 290,
    "hanger": 291,
    "adding": 292,
    "touch": 293,
    "wears": 294,
    "bag": 295,
    "bustling": 296,
    "by": 297,
    "resembling": 298,
    "tablecloth": 299,
    "polo": 300,
    "view": 301,
    "outside": 302,
    "living": 303,
    "chinos": 304,
    "button": 305,
    "up": 306,
    "plants": 307,
    "horizontal": 308,
    "stripes": 309,
    "serene": 310,
    "along": 311,
    "grassy": 312,
    "serves": 313,
    "as": 314,
    "line": 315,
    "tranquil": 316,
    "bold": 317,
    "sporty": 318,
    "home": 319,
    "man": 320,
    "pocket": 321,
    "railings": 322,
    "figures": 323,
    "puffed": 324,
    "triangular": 325,
    "parked": 326,
    "cars": 327,
    "under": 328,
    "bright": 329,
    "daylight": 330,
    "monkey": 331,
    "face": 332,
    "cap": 333,
    "airy": 334,
    "collar": 335,
    "surfaces": 336,
    "small": 337,
    "doors": 338,
    "bathroom": 339,
    "mirror": 340,
    "reflects": 341,
    "showing": 342,
    "belt": 343,
    "tone": 344,
    "stripe": 345,
    "detail": 346,
    "cat": 347,
    "styled": 348,
    "casually": 349,
    "displayed": 350,
    "bed": 351,
    "ribbed": 352,
    "knit": 353,
    "outdoors": 354,
    "surface": 355,
    "abstract": 356,
    "neatly": 357,
    "arranged": 358,
    "blanket": 359,
    "color": 360,
    "hoodie": 361,
    "interior": 362,
    "accents": 363,
    "poster": 364,
    "hotel": 365,
    "hallway": 366,
    "desk": 367,
    "vertical": 368,
    "muted": 369,
    "laid": 370,
    "out": 371,
    "bedspread": 372,
    "vest": 373,
    "minimal": 374,
    "computer": 375,
    "setup": 376,
    "parking": 377,
    "lot": 378,
    "form": 379,
    "simple": 380,
    "toned": 381,
    "brimmed": 382,
    "hat": 383,
    "gate": 384,
    "roof": 385,
    "structure": 386,
    "trim": 387,
    "car": 388,
    "v": 389,
    "neck": 390,
    "lace": 391,
    "hem": 392,
    "sofa": 393,
    "boutique": 394,
    "mirrors": 395,
    "polka": 396,
    "dotted": 397,
    "adds": 398,
    "playful": 399,
    "square": 400,
    "neckline": 401,
    "bow": 402,
    "at": 403,
    "include": 404,
    "sidewalk": 405,
    "frayed": 406,
    "cabinets": 407,
    "sweater": 408,
    "decorative": 409,
    "sign": 410,
    "down": 411,
    "side": 412,
    "focus": 413,
    "distractions": 414,
    "items": 415,
    "adorn": 416,
    "cinched": 417,
    "selfie": 418,
    "jacket": 419,
    "glimpse": 420,
    "crafted": 421,
    "from": 422,
    "sophisticated": 423,
    "ruffled": 424,
    "brick": 425,
    "socks": 426,
    "sunny": 427,
    "day": 428,
    "bushes": 429,
    "bedroom": 430,
    "circular": 431,
    "designs": 432,
    "well": 433,
    "lit": 434,
    "dressing": 435,
    "countertop": 436,
    "nature": 437,
    "frame": 438,
    "framed": 439,
    "pictures": 440,
    "cropped": 441,
    "chic": 442,
    "object": 443,
    "bedding": 444,
    "purple": 445,
    "textures": 446,
    "beanie": 447,
    "behind": 448,
    "block": 449,
    "panel": 450,
    "fringed": 451,
    "colors": 452,
    "paneling": 453,
    "vase": 454,
    "stand": 455,
    "ground": 456,
    "subject": 457,
    "calm": 458,
    "stool": 459,
    "partially": 460,
    "curtain": 461,
    "leg": 462,
    "fashion": 463,
    "cartoon": 464,
    "pillows": 465,
    "tag": 466,
    "it": 467,
    "for": 468,
    "triangle": 469,
    "environment": 470,
    "keyhole": 471,
    "filters": 472,
    "highlighting": 473,
    "seating": 474,
    "pavement": 475,
    "structures": 476,
    "zip": 477,
    "accessorized": 478,
    "without": 479,
    "logo": 480,
    "teal": 481,
    "part": 482,
    "architecture": 483,
    "sweatpants": 484,
    "you": 485,
    "letters": 486,
    "leggings": 487,
    "shoes": 488,
    "reflection": 489,
    "toiletries": 490,
    "metallic": 491,
    "pop": 492,
    "leather": 493,
    "doorway": 494,
    "some": 495,
    "lime": 496,
    "chest": 497,
    "standing": 498,
    "hints": 499,
    "cityscape": 500,
    "khaki": 501,
    "corner": 502,
    "summer": 503,
    "surroundings": 504,
    "chanel": 505,
    "book": 506,
    "dots": 507,
    "complemented": 508,
    "enhancing": 509,
    "back": 510,
    "item": 511,
    "heels": 512,
    "staircase": 513,
    "crisp": 514,
    "shoulders": 515,
    "poses": 516,
    "crates": 517,
    "over": 518,
    "bar": 519,
    "skinny": 520,
    "overlay": 521,
    "cream": 522,
    "beaded": 523,
    "necklace": 524,
    "filtering": 525,
    "inviting": 526,
    "racks": 527,
    "pillow": 528,
    "classic": 529,
    "lies": 530,
    "various": 531,
    "bottles": 532,
    "overalls": 533,
    "hint": 534,
    "personal": 535,
    "shows": 536,
    "markings": 537,
    "showcasing": 538,
    "partial": 539,
    "puffer": 540,
    "gold": 541,
    "exuding": 542,
    "feminine": 543,
    "olive": 544,
    "cargo": 545,
    "minimalistic": 546,
    "intricate": 547,
    "office": 548,
    "fixtures": 549,
    "bomber": 550,
    "zipper": 551,
    "electrical": 552,
    "outlet": 553,
    "hue": 554,
    "nearby": 555,
    "detailing": 556,
    "flat": 557,
    "contrast": 558,
    "picture": 559,
    "hangs": 560,
    "fan": 561,
    "dim": 562,
    "buttoned": 563,
    "sandals": 564,
    "she": 565,
    "sits": 566,
    "elegance": 567,
    "deer": 568,
    "head": 569,
    "horizontally": 570,
    "pastel": 571,
    "athletic": 572,
    "retail": 573,
    "enhances": 574,
    "quilted": 575,
    "blazer": 576,
    "slightly": 577,
    "leading": 578,
    "another": 579,
    "ripped": 580,
    "lines": 581,
    "wallpaper": 582,
    "reflecting": 583,
    "pleated": 584,
    "layered": 585,
    "foam": 586,
    "mat": 587,
    "reading": 588,
    "lonely": 589,
    "vending": 590,
    "machine": 591,
    "star": 592,
    "camouflage": 593,
    "warmth": 594,
    "character": 595,
    "sunglasses": 596,
    "dining": 597,
    "pencil": 598,
    "jumpsuit": 599,
    "headband": 600,
    "quiet": 601,
    "entrance": 602,
    "cluttered": 603,
    "cardboard": 604,
    "box": 605,
    "facade": 606,
    "chalkboard": 607,
    "crop": 608,
    "tank": 609,
    "pearl": 610,
    "linens": 611,
    "waves": 612,
    "pajama": 613,
    "breathable": 614,
    "dresser": 615,
    "handbag": 616,
    "rug": 617,
    "signage": 618,
    "detailed": 619,
    "water": 620,
    "other": 621,
    "household": 622,
    "overall": 623,
    "illuminated": 624,
    "reflective": 625,
    "cold": 626,
    "vehicles": 627,
    "kitchen": 628,
    "pinafore": 629,
    "rack": 630,
    "scalloped": 631,
    "suggests": 632,
    "gentle": 633,
    "lettering": 634,
    "suitcase": 635,
    "covered": 636,
    "letting": 637,
    "image": 638,
    "cabinet": 639,
    "tights": 640,
    "distance": 641,
    "walkway": 642,
    "waterfront": 643,
    "skies": 644,
    "lavender": 645,
    "turtleneck": 646,
    "embellishments": 647,
    "midi": 648,
    "edgy": 649,
    "vintage": 650,
    "maroon": 651,
    "stools": 652,
    "silver": 653,
    "chain": 654,
    "closed": 655,
    "graffiti": 656,
    "open": 657,
    "tree": 658,
    "tiered": 659,
    "henley": 660,
    "artistic": 661,
    "shops": 662,
    "furnishings": 663,
    "television": 664,
    "waistband": 665,
    "m": 666,
    "brightly": 667,
    "shapes": 668,
    "individual": 669,
    "palm": 670,
    "turquoise": 671,
    "dot": 672,
    "confidently": 673,
    "mounted": 674,
    "holding": 675,
    "books": 676,
    "stocked": 677,
    "composition": 678,
    "left": 679,
    "shirts": 680,
    "pizza": 681,
    "artwork": 682,
    "mannequin": 683,
    "filled": 684,
    "architectural": 685,
    "storefront": 686,
    "displays": 687,
    "art": 688,
    "inside": 689,
    "stacked": 690,
    "ceiling": 691,
    "varsity": 692,
    "garden": 693,
    "boxes": 694,
    "beach": 695,
    "sunlight": 696,
    "sweatshirt": 697,
    "seated": 698,
    "zebra": 699,
    "foreground": 700,
    "heeled": 701,
    "labeled": 702,
    "products": 703,
    "spaghetti": 704,
    "strap": 705,
    "lined": 706,
    "patch": 707,
    "shelf": 708,
    "lived": 709,
    "scoop": 710,
    "paint": 711,
    "owl": 712,
    "body": 713,
    "bucket": 714,
    "embroidered": 715,
    "capri": 716,
    "hooded": 717,
    "cover": 718,
    "mickey": 719,
    "mouse": 720,
    "highlight": 721,
    "adidas": 722
  },
  "idx2word": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "<START>",
    "3": "<END>",
    "4": "black",
    "5": "short",
    "6": "sleeved",
    "7": "t",
    "8": "shirt",
    "9": "paired",
    "10": "with",
    "11": "blue",
    "12": "jeans",
    "13": "and",
    "14": "white",
    "15": "sneakers",
    "16": "a",
    "17": "casual",
    "18": "indoor",
    "19": "setting",
    "20": "in",
    "21": "modern",
    "22": "cafe",
    "23": "glass",
    "24": "windows",
    "25": "wooden",
    "26": "benches",
    "27": "visible",
    "28": "the",
    "29": "background",
    "30": "two",
    "31": "wear",
    "32": "featuring",
    "33": "navy",
    "34": "long",
    "35": "sleeve",
    "36": "top",
    "37": "light",
    "38": "mini",
    "39": "skirt",
    "40": "scene",
    "41": "is",
    "42": "set",
    "43": "against",
    "44": "minimalist",
    "45": "backdrop",
    "46": "sleek",
    "47": "metal",
    "48": "wall",
    "49": "railing",
    "50": "add",
    "51": "to",
    "52": "urban",
    "53": "aesthetic",
    "54": "flowy",
    "55": "blouse",
    "56": "sleeves",
    "57": "subtle",
    "58": "floral",
    "59": "pattern",
    "60": "caf",
    "61": "design",
    "62": "features",
    "63": "coffee",
    "64": "shop",
    "65": "counter",
    "66": "warm",
    "67": "lighting",
    "68": "loose",
    "69": "fitting",
    "70": "cardigan",
    "71": "cozy",
    "72": "decor",
    "73": "large",
    "74": "furniture",
    "75": "enhance",
    "76": "ambiance",
    "77": "mint",
    "78": "green",
    "79": "distressed",
    "80": "textured",
    "81": "grid",
    "82": "like",
    "83": "fence",
    "84": "soft",
    "85": "natural",
    "86": "sleeveless",
    "87": "knee",
    "88": "length",
    "89": "dress",
    "90": "fitted",
    "91": "bodice",
    "92": "flared",
    "93": "on",
    "94": "dark",
    "95": "studio",
    "96": "plain",
    "97": "neutral",
    "98": "solid",
    "99": "gray",
    "100": "emphasizing",
    "101": "model",
    "102": "fabric",
    "103": "adorned",
    "104": "delicate",
    "105": "devoid",
    "106": "of",
    "107": "additional",
    "108": "elements",
    "109": "focusing",
    "110": "solely",
    "111": "plaid",
    "112": "relaxed",
    "113": "fit",
    "114": "texture",
    "115": "style",
    "116": "clean",
    "117": "uncluttered",
    "118": "garment",
    "119": "denim",
    "120": "shorts",
    "121": "rolled",
    "122": "cuffs",
    "123": "red",
    "124": "street",
    "125": "person",
    "126": "walking",
    "127": "paved",
    "128": "path",
    "129": "trees",
    "130": "building",
    "131": "patterned",
    "132": "jogger",
    "133": "pants",
    "134": "drawstring",
    "135": "waist",
    "136": "elastic",
    "137": "outdoor",
    "138": "rustic",
    "139": "door",
    "140": "concrete",
    "141": "stone",
    "142": "steps",
    "143": "base",
    "144": "material",
    "145": "appears",
    "146": "be",
    "147": "lightweight",
    "148": "indoors",
    "149": "likely",
    "150": "no",
    "151": "details",
    "152": "or",
    "153": "objects",
    "154": "made",
    "155": "smooth",
    "156": "flowing",
    "157": "unadorned",
    "158": "attention",
    "159": "outfit",
    "160": "colorful",
    "161": "graphic",
    "162": "print",
    "163": "comfortable",
    "164": "woman",
    "165": "posing",
    "166": "beige",
    "167": "couch",
    "168": "includes",
    "169": "potted",
    "170": "plant",
    "171": "window",
    "172": "blinds",
    "173": "bookshelf",
    "174": "maxi",
    "175": "sheen",
    "176": "high",
    "177": "vibrant",
    "178": "lush",
    "179": "greenery",
    "180": "flowers",
    "181": "foliage",
    "182": "creating",
    "183": "lounge",
    "184": "area",
    "185": "bench",
    "186": "striped",
    "187": "cushion",
    "188": "slim",
    "189": "weathered",
    "190": "grass",
    "191": "scattered",
    "192": "atmosphere",
    "193": "industrial",
    "194": "vibe",
    "195": "flooring",
    "196": "mix",
    "197": "an",
    "198": "blurred",
    "199": "clear",
    "200": "sky",
    "201": "checkered",
    "202": "piece",
    "203": "yet",
    "204": "stylish",
    "205": "look",
    "206": "panels",
    "207": "walls",
    "208": "create",
    "209": "contemporary",
    "210": "ensemble",
    "211": "shopping",
    "212": "mall",
    "213": "display",
    "214": "cases",
    "215": "floors",
    "216": "pink",
    "217": "waisted",
    "218": "streaming",
    "219": "through",
    "220": "sheer",
    "221": "curtains",
    "222": "armchair",
    "223": "floor",
    "224": "lamp",
    "225": "matching",
    "226": "both",
    "227": "possibly",
    "228": "park",
    "229": "tables",
    "230": "chairs",
    "231": "deck",
    "232": "suggesting",
    "233": "trousers",
    "234": "chair",
    "235": "table",
    "236": "elegant",
    "237": "off",
    "238": "shoulder",
    "239": "puffy",
    "240": "tones",
    "241": "intimate",
    "242": "oversized",
    "243": "stands",
    "244": "city",
    "245": "near",
    "246": "storefronts",
    "247": "are",
    "248": "silhouette",
    "249": "highlights",
    "250": "s",
    "251": "coat",
    "252": "wide",
    "253": "underneath",
    "254": "streetwear",
    "255": "yellow",
    "256": "distant",
    "257": "pedestrians",
    "258": "depth",
    "259": "lively",
    "260": "peach",
    "261": "colored",
    "262": "tiled",
    "263": "suggest",
    "264": "public",
    "265": "space",
    "266": "text",
    "267": "geometric",
    "268": "patterns",
    "269": "orange",
    "270": "hues",
    "271": "room",
    "272": "cotton",
    "273": "lights",
    "274": "buildings",
    "275": "indistinct",
    "276": "brown",
    "277": "boots",
    "278": "clothing",
    "279": "store",
    "280": "shelves",
    "281": "hanging",
    "282": "decorations",
    "283": "embroidery",
    "284": "tiles",
    "285": "road",
    "286": "tunic",
    "287": "three",
    "288": "quarter",
    "289": "front",
    "290": "pockets",
    "291": "hanger",
    "292": "adding",
    "293": "touch",
    "294": "wears",
    "295": "bag",
    "296": "bustling",
    "297": "by",
    "298": "resembling",
    "299": "tablecloth",
    "300": "polo",
    "301": "view",
    "302": "outside",
    "303": "living",
    "304": "chinos",
    "305": "button",
    "306": "up",
    "307": "plants",
    "308": "horizontal",
    "309": "stripes",
    "310": "serene",
    "311": "along",
    "312": "grassy",
    "313": "serves",
    "314": "as",
    "315": "line",
    "316": "tranquil",
    "317": "bold",
    "318": "sporty",
    "319": "home",
    "320": "man",
    "321": "pocket",
    "322": "railings",
    "323": "figures",
    "324": "puffed",
    "325": "triangular",
    "326": "parked",
    "327": "cars",
    "328": "under",
    "329": "bright",
    "330": "daylight",
    "331": "monkey",
    "332": "face",
    "333": "cap",
    "334": "airy",
    "335": "collar",
    "336": "surfaces",
    "337": "small",
    "338": "doors",
    "339": "bathroom",
    "340": "mirror",
    "341": "reflects",
    "342": "showing",
    "343": "belt",
    "344": "tone",
    "345": "stripe",
    "346": "detail",
    "347": "cat",
    "348": "styled",
    "349": "casually",
    "350": "displayed",
    "351": "bed",
    "352": "ribbed",
    "353": "knit",
    "354": "outdoors",
    "355": "surface",
    "356": "abstract",
    "357": "neatly",
    "358": "arranged",
    "359": "blanket",
    "360": "color",
    "361": "hoodie",
    "362": "interior",
    "363": "accents",
    "364": "poster",
    "365": "hotel",
    "366": "hallway",
    "367": "desk",
    "368": "vertical",
    "369": "muted",
    "370": "laid",
    "371": "out",
    "372": "bedspread",
    "373": "vest",
    "374": "minimal",
    "375": "computer",
    "376": "setup",
    "377": "parking",
    "378": "lot",
    "379": "form",
    "380": "simple",
    "381": "toned",
    "382": "brimmed",
    "383": "hat",
    "384": "gate",
    "385": "roof",
    "386": "structure",
    "387": "trim",
    "388": "car",
    "389": "v",
    "390": "neck",
    "391": "lace",
    "392": "hem",
    "393": "sofa",
    "394": "boutique",
    "395": "mirrors",
    "396": "polka",
    "397": "dotted",
    "398": "adds",
    "399": "playful",
    "400": "square",
    "401": "neckline",
    "402": "bow",
    "403": "at",
    "404": "include",
    "405": "sidewalk",
    "406": "frayed",
    "407": "cabinets",
    "408": "sweater",
    "409": "decorative",
    "410": "sign",
    "411": "down",
    "412": "side",
    "413": "focus",
    "414": "distractions",
    "415": "items",
    "416": "adorn",
    "417": "cinched",
    "418": "selfie",
    "419": "jacket",
    "420": "glimpse",
    "421": "crafted",
    "422": "from",
    "423": "sophisticated",
    "424": "ruffled",
    "425": "brick",
    "426": "socks",
    "427": "sunny",
    "428": "day",
    "429": "bushes",
    "430": "bedroom",
    "431": "circular",
    "432": "designs",
    "433": "well",
    "434": "lit",
    "435": "dressing",
    "436": "countertop",
    "437": "nature",
    "438": "frame",
    "439": "framed",
    "440": "pictures",
    "441": "cropped",
    "442": "chic",
    "443": "object",
    "444": "bedding",
    "445": "purple",
    "446": "textures",
    "447": "beanie",
    "448": "behind",
    "449": "block",
    "450": "panel",
    "451": "fringed",
    "452": "colors",
    "453": "paneling",
    "454": "vase",
    "455": "stand",
    "456": "ground",
    "457": "subject",
    "458": "calm",
    "459": "stool",
    "460": "partially",
    "461": "curtain",
    "462": "leg",
    "463": "fashion",
    "464": "cartoon",
    "465": "pillows",
    "466": "tag",
    "467": "it",
    "468": "for",
    "469": "triangle",
    "470": "environment",
    "471": "keyhole",
    "472": "filters",
    "473": "highlighting",
    "474": "seating",
    "475": "pavement",
    "476": "structures",
    "477": "zip",
    "478": "accessorized",
    "479": "without",
    "480": "logo",
    "481": "teal",
    "482": "part",
    "483": "architecture",
    "484": "sweatpants",
    "485": "you",
    "486": "letters",
    "487": "leggings",
    "488": "shoes",
    "489": "reflection",
    "490": "toiletries",
    "491": "metallic",
    "492": "pop",
    "493": "leather",
    "494": "doorway",
    "495": "some",
    "496": "lime",
    "497": "chest",
    "498": "standing",
    "499": "hints",
    "500": "cityscape",
    "501": "khaki",
    "502": "corner",
    "503": "summer",
    "504": "surroundings",
    "505": "chanel",
    "506": "book",
    "507": "dots",
    "508": "complemented",
    "509": "enhancing",
    "510": "back",
    "511": "item",
    "512": "heels",
    "513": "staircase",
    "514": "crisp",
    "515": "shoulders",
    "516": "poses",
    "517": "crates",
    "518": "over",
    "519": "bar",
    "520": "skinny",
    "521": "overlay",
    "522": "cream",
    "523": "beaded",
    "524": "necklace",
    "525": "filtering",
    "526": "inviting",
    "527": "racks",
    "528": "pillow",
    "529": "classic",
    "530": "lies",
    "531": "various",
    "532": "bottles",
    "533": "overalls",
    "534": "hint",
    "535": "personal",
    "536": "shows",
    "537": "markings",
    "538": "showcasing",
    "539": "partial",
    "540": "puffer",
    "541": "gold",
    "542": "exuding",
    "543": "feminine",
    "544": "olive",
    "545": "cargo",
    "546": "minimalistic",
    "547": "intricate",
    "548": "office",
    "549": "fixtures",
    "550": "bomber",
    "551": "zipper",
    "552": "electrical",
    "553": "outlet",
    "554": "hue",
    "555": "nearby",
    "556": "detailing",
    "557": "flat",
    "558": "contrast",
    "559": "picture",
    "560": "hangs",
    "561": "fan",
    "562": "dim",
    "563": "buttoned",
    "564": "sandals",
    "565": "she",
    "566": "sits",
    "567": "elegance",
    "568": "deer",
    "569": "head",
    "570": "horizontally",
    "571": "pastel",
    "572": "athletic",
    "573": "retail",
    "574": "enhances",
    "575": "quilted",
    "576": "blazer",
    "577": "slightly",
    "578": "leading",
    "579": "another",
    "580": "ripped",
    "581": "lines",
    "582": "wallpaper",
    "583": "reflecting",
    "584": "pleated",
    "585": "layered",
    "586": "foam",
    "587": "mat",
    "588": "reading",
    "589": "lonely",
    "590": "vending",
    "591": "machine",
    "592": "star",
    "593": "camouflage",
    "594": "warmth",
    "595": "character",
    "596": "sunglasses",
    "597": "dining",
    "598": "pencil",
    "599": "jumpsuit",
    "600": "headband",
    "601": "quiet",
    "602": "entrance",
    "603": "cluttered",
    "604": "cardboard",
    "605": "box",
    "606": "facade",
    "607": "chalkboard",
    "608": "crop",
    "609": "tank",
    "610": "pearl",
    "611": "linens",
    "612": "waves",
    "613": "pajama",
    "614": "breathable",
    "615": "dresser",
    "616": "handbag",
    "617": "rug",
    "618": "signage",
    "619": "detailed",
    "620": "water",
    "621": "other",
    "622": "household",
    "623": "overall",
    "624": "illuminated",
    "625": "reflective",
    "626": "cold",
    "627": "vehicles",
    "628": "kitchen",
    "629": "pinafore",
    "630": "rack",
    "631": "scalloped",
    "632": "suggests",
    "633": "gentle",
    "634": "lettering",
    "635": "suitcase",
    "636": "covered",
    "637": "letting",
    "638": "image",
    "639": "cabinet",
    "640": "tights",
    "641": "distance",
    "642": "walkway",
    "643": "waterfront",
    "644": "skies",
    "645": "lavender",
    "646": "turtleneck",
    "647": "embellishments",
    "648": "midi",
    "649": "edgy",
    "650": "vintage",
    "651": "maroon",
    "652": "stools",
    "653": "silver",
    "654": "chain",
    "655": "closed",
    "656": "graffiti",
    "657": "open",
    "658": "tree",
    "659": "tiered",
    "660": "henley",
    "661": "artistic",
    "662": "shops",
    "663": "furnishings",
    "664": "television",
    "665": "waistband",
    "666": "m",
    "667": "brightly",
    "668": "shapes",
    "669": "individual",
    "670": "palm",
    "671": "turquoise",
    "672": "dot",
    "673": "confidently",
    "674": "mounted",
    "675": "holding",
    "676": "books",
    "677": "stocked",
    "678": "composition",
    "679": "left",
    "680": "shirts",
    "681": "pizza",
    "682": "artwork",
    "683": "mannequin",
    "684": "filled",
    "685": "architectural",
    "686": "storefront",
    "687": "displays",
    "688": "art",
    "689": "inside",
    "690": "stacked",
    "691": "ceiling",
    "692": "varsity",
    "693": "garden",
    "694": "boxes",
    "695": "beach",
    "696": "sunlight",
    "697": "sweatshirt",
    "698": "seated",
    "699": "zebra",
    "700": "foreground",
    "701": "heeled",
    "702": "labeled",
    "703": "products",
    "704": "spaghetti",
    "705": "strap",
    "706": "lined",
    "707": "patch",
    "708": "shelf",
    "709": "lived",
    "710": "scoop",
    "711": "paint",
    "712": "owl",
    "713": "body",
    "714": "bucket",
    "715": "embroidered",
    "716": "capri",
    "717": "hooded",
    "718": "cover",
    "719": "mickey",
    "720": "mouse",
    "721": "highlight",
    "722": "adidas"
  },
  "vocab_size": 723,
  "min_freq": 3,
  "special_tokens": {
    "PAD": {
      "token": "<PAD>",
      "idx": 0
    },
    "UNK": {
      "token": "<UNK>",
      "idx": 1
    },
    "START": {
      "token": "<START>",
      "idx": 2
    },
    "END": {
      "token": "<END>",
      "idx": 3
    }
  }
}